Repository: MrThearMan/Stonks
Catalog: analyzer/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Stock
fi: Osake

source: Start Date
fi: Aloituspäivä

source: End Date (optional)
fi: Päättymispäivä (valinnainen)

source: Home
fi: Koti

source: STOCK ANALYZER
fi: OSAKKEIDEN ANALYSOINTI

source: Click or drop file here calculate from CSV
fi: Klikkaa tai pudota tiedosto tänne

source: Longest bullish streak
fi: Pisin nouseva putki

source: days
fi: päivää

source: Stock History by Volume and Price Change
fi: Osakehistoria myytyjen osakkeiden ja hinnan muutoksen mukaan

source: Best Opening Price Compared to Five Day SMA
fi: Paras aloitushinta verrattuna viiden päivän SMA:han

source: Only one file at a time
fi: Vain yksi tiedosto kerrallaan

source: Filetype must be .csv
fi: Tiedostotyypin tulee olla .csv

source: No results found.
fi: Hakutulosta ei löytynyt.

source: REQUEST FOR STOCK '{stock}' FAILED.
fi: SIVUPYYNTO OSAKKEELLE '{stock}' EPÄONNISTUI.

source: Date
fi: Päivä

source: Volume
fi: Osakemäärä

source: Price Change ($)
fi: Hinnan muutos ($)

source: Price Change (%)
fi: Hinnan muutos (%)

source: Error: Request failed: {error_con}.
fi: Virhe: Sivu ei vastaa: {error_con}.

source: During API search: {error_val}. Search failed.
fi: API haku virhe: {error_val}. Haku ei onnistunut.

source: Error: {error_val}
fi: Virhe: {error_val}

source: During csv import: Key {error_key} not found. Import halted.
fi: CSV-luku virhe: Avainta {error_key} ei löytynyt. Luku ei onnistunut.

source: Error: Key {error_key} not found in CSV.
fi: Virhe: Avainta {error_key} ei löytynyt taulukosta.

source: During csv import: {error_val}. Import halted.
fi: CSV-luku virhe: {error_val}. Luku ei onnistunut.

source: Error: {error_val} in CSV.
fi: Virhe: {error_val} taulukossa.
